#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/evb-sandbox/evb-gcp-terraform/runs/run-PZLQavS55Y6T7ucW[0m
[0m
Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.gke.google_container_cluster.cluster[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_cluster" "cluster" {
      [32m+[0m [0m[1m[0mcluster_ipv4_cidr[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdatapath_provider[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_max_pods_per_node[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0menable_binary_authorization[0m[0m = false
      [32m+[0m [0m[1m[0menable_intranode_visibility[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0menable_kubernetes_alpha[0m[0m     = false
      [32m+[0m [0m[1m[0menable_legacy_abac[0m[0m          = false
      [32m+[0m [0m[1m[0menable_shielded_nodes[0m[0m       = true
      [32m+[0m [0m[1m[0mendpoint[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = 1
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mlogging_service[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mmaster_version[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring_service[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "k8s-cluster-01"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                     = "k8s-network"
      [32m+[0m [0m[1m[0mnetworking_mode[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnode_locations[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mnode_version[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mservices_ipv4_cidr[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = "k8s-network-subnet"
      [32m+[0m [0m[1m[0mtpu_ipv4_cidr_block[0m[0m         = (known after apply)

      [32m+[0m [0maddons_config {
          [32m+[0m [0mcloudrun_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mload_balancer_type[0m[0m = (known after apply)
            }

          [32m+[0m [0mgcp_filestore_csi_driver_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhorizontal_pod_autoscaling {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhttp_load_balancing {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mnetwork_policy_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mauthenticator_groups_config {
          [32m+[0m [0m[1m[0msecurity_group[0m[0m = (known after apply)
        }

      [32m+[0m [0mcluster_autoscaling {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)

          [32m+[0m [0mauto_provisioning_defaults {
              [32m+[0m [0m[1m[0mimage_type[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m = (known after apply)
            }

          [32m+[0m [0mresource_limits {
              [32m+[0m [0m[1m[0mmaximum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mminimum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mresource_type[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_nodes {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mdatabase_encryption {
          [32m+[0m [0m[1m[0mkey_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstate[0m[0m    = (known after apply)
        }

      [32m+[0m [0mdefault_snat_status {
          [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mip_allocation_policy {
          [32m+[0m [0m[1m[0mcluster_ipv4_cidr_block[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mcluster_secondary_range_name[0m[0m  = "k8s-network-pod-range"
          [32m+[0m [0m[1m[0mservices_ipv4_cidr_block[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mservices_secondary_range_name[0m[0m = "k8s-network-svc-range"
        }

      [32m+[0m [0mlogging_config {
          [32m+[0m [0m[1m[0menable_components[0m[0m = (known after apply)
        }

      [32m+[0m [0mmaster_auth {
          [32m+[0m [0m[1m[0mclient_certificate[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mclient_key[0m[0m             = (sensitive value)
          [32m+[0m [0m[1m[0mcluster_ca_certificate[0m[0m = (known after apply)

          [32m+[0m [0mclient_certificate_config {
              [32m+[0m [0m[1m[0missue_client_certificate[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mmonitoring_config {
          [32m+[0m [0m[1m[0menable_components[0m[0m = (known after apply)
        }

      [32m+[0m [0mnetwork_policy {
          [32m+[0m [0m[1m[0menabled[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mprovider[0m[0m = (known after apply)
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mnode_group[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mtaint[0m[0m             = (known after apply)

          [32m+[0m [0mgcfs_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgvnic {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_pool {
          [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0minstance_group_urls[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mnode_count[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mnode_locations[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mversion[0m[0m                     = (known after apply)

          [32m+[0m [0mautoscaling {
              [32m+[0m [0m[1m[0mmax_node_count[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mmin_node_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mmanagement {
              [32m+[0m [0m[1m[0mauto_repair[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_config {
              [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mmachine_type[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mnode_group[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mpreemptible[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mtags[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mtaint[0m[0m             = (known after apply)

              [32m+[0m [0mgcfs_config {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mgvnic {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mshielded_instance_config {
                  [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
                }

              [32m+[0m [0mworkload_metadata_config {
                  [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
                }
            }

          [32m+[0m [0mupgrade_settings {
              [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mrelease_channel {
          [32m+[0m [0m[1m[0mchannel[0m[0m = (known after apply)
        }

      [32m+[0m [0mvertical_pod_autoscaling {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mworkload_identity_config {
          [32m+[0m [0m[1m[0mworkload_pool[0m[0m = (known after apply)
        }
    }

[1m  # module.instances.google_compute_instance.vm_instance[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "vm_instance" {
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false
      [32m+[0m [0m[1m[0mguest_accelerator[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "f1-micro"
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = [
          [32m+[0m [0m"dev",
          [32m+[0m [0m"web",
        ]
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                 = (known after apply)

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0mimage[0m[0m  = "debian-cloud/debian-11"
              [32m+[0m [0m[1m[0mlabels[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m            = "terraform-network"
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m = (known after apply)

          [32m+[0m [0maccess_config {
              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m         = (known after apply)

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }
        }
    }

[1m  # module.instances.random_pet.petname[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_pet" "petname" {
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m    = 2
      [32m+[0m [0m[1m[0mseparator[0m[0m = "-"
    }

[1m  # module.network.google_compute_network.k8s_network[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "k8s_network" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m         = false
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m = false
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                            = "k8s-network"
      [32m+[0m [0m[1m[0mproject[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                       = (known after apply)
    }

[1m  # module.network.google_compute_network.vpc_network[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "vpc_network" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m         = true
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m = false
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                            = "terraform-network"
      [32m+[0m [0m[1m[0mproject[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                       = (known after apply)
    }

[1m  # module.network.google_compute_subnetwork.k8s_network_subnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "k8s_network_subnet" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mexternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "10.2.0.0/16"
      [32m+[0m [0m[1m[0mipv6_cidr_range[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "k8s-network-subnet"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mpurpose[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0msecondary_ip_range[0m[0m         = [
          [32m+[0m [0m{
              [32m+[0m [0mip_cidr_range = "192.168.10.0/24"
              [32m+[0m [0mrange_name    = "k8s-network-svc-range"
            },
          [32m+[0m [0m{
              [32m+[0m [0mip_cidr_range = "192.168.96.0/21"
              [32m+[0m [0mrange_name    = "k8s-network-pod-range"
            },
        ]
      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstack_type[0m[0m                 = (known after apply)
    }

[1m  # module.storage.google_storage_bucket.gcs_bucket[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket" "gcs_bucket" {
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "US"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "evb-gcp-terraform"
      [32m+[0m [0m[1m[0mproject[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m               = "Standard"
      [32m+[0m [0m[1m[0muniform_bucket_level_access[0m[0m = true
      [32m+[0m [0m[1m[0murl[0m[0m                         = (known after apply)
    }

[0m[1mPlan:[0m 7 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mgcs_bucket[0m[0m       = "evb-gcp-terraform"
  [32m+[0m [0m[1m[0mk8s_cluster_name[0m[0m = "k8s-cluster-01"
  [32m+[0m [0m[1m[0mk8s_network[0m[0m      = "k8s-network"
  [32m+[0m [0m[1m[0mvm_ip[0m[0m            = (known after apply)
  [32m+[0m [0m[1m[0mvm_name[0m[0m          = (known after apply)
  [32m+[0m [0m[1m[0mvpc_network[0m[0m      = "terraform-network"
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named
[33m│[0m [0m"TF_VAR_k8s_network_svc_range" but a value was found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-PZLQavS55Y6T7ucW/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named
[33m│[0m [0m"TF_VAR_k8s_network_pod_range" but a value was found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-PZLQavS55Y6T7ucW/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m

```

</details>

*Pushed by: @vanberge, Action: `pull_request`*